rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_RESULT_DMA_TCD.h
  __IO uint32_t TCD18_SADDR;                       /**< TCD Source Address, offset: 0x22020 */
  __IO uint16_t TCD18_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x22024 */
  __IO uint16_t TCD18_ATTR;                        /**< TCD Transfer Attributes, offset: 0x22026 */
  union {                                          /* offset: 0x22028 */
    __IO uint32_t TCD18_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x22028 */
    __IO uint32_t TCD18_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x22028 */
  } NBYTES18;
  __IO uint32_t TCD18_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x2202C */
  __IO uint32_t TCD18_DADDR;                       /**< TCD Destination Address, offset: 0x22030 */
  __IO uint16_t TCD18_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x22034 */
  union {                                          /* offset: 0x22036 */
    __IO uint16_t TCD18_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x22036 */
    __IO uint16_t TCD18_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x22036 */
  } CITER18;
  __IO uint32_t TCD18_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x22038 */
  __IO uint16_t TCD18_CSR;                         /**< TCD Control and Status, offset: 0x2203C */
  union {                                          /* offset: 0x2203E */
    __IO uint16_t TCD18_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x2203E */
    __IO uint16_t TCD18_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x2203E */
  } BITER18;
  uint8_t RESERVED_17[1236928];
  __IO uint32_t CH3_CSR;                           /**< Channel Control and Status, offset: 0x150000 */
  __IO uint32_t CH3_ES;                            /**< Channel Error Status, offset: 0x150004 */
  __IO uint32_t CH3_INT;                           /**< Channel Interrupt Status, offset: 0x150008 */
  __IO uint32_t CH3_SBR;                           /**< Channel System Bus, offset: 0x15000C */
  __IO uint32_t CH3_PRI;                           /**< Channel Priority, offset: 0x150010 */
  uint8_t RESERVED_18[12];
  __IO uint32_t TCD3_SADDR;                        /**< TCD Source Address, offset: 0x150020 */
  __IO uint16_t TCD3_SOFF;                         /**< TCD Signed Source Address Offset, offset: 0x150024 */
  __IO uint16_t TCD3_ATTR;                         /**< TCD Transfer Attributes, offset: 0x150026 */
  union {                                          /* offset: 0x150028 */
    __IO uint32_t TCD3_NBYTES_MLOFFNO;               /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x150028 */
    __IO uint32_t TCD3_NBYTES_MLOFFYES;              /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x150028 */
  } NBYTES3;
  __IO uint32_t TCD3_SLAST_SDA;                    /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x15002C */
  __IO uint32_t TCD3_DADDR;                        /**< TCD Destination Address, offset: 0x150030 */
  __IO uint16_t TCD3_DOFF;                         /**< TCD Signed Destination Address Offset, offset: 0x150034 */
  union {                                          /* offset: 0x150036 */
    __IO uint16_t TCD3_CITER_ELINKNO;                /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x150036 */
    __IO uint16_t TCD3_CITER_ELINKYES;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x150036 */
  } CITER3;
  __IO uint32_t TCD3_DLAST_SGA;                    /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x150038 */
  __IO uint16_t TCD3_CSR;                          /**< TCD Control and Status, offset: 0x15003C */
  union {                                          /* offset: 0x15003E */
    __IO uint16_t TCD3_BITER_ELINKNO;                /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x15003E */
    __IO uint16_t TCD3_BITER_ELINKYES;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x15003E */
  } BITER3;
  uint8_t RESERVED_19[4032];
  __IO uint32_t CH11_CSR;                          /**< Channel Control and Status, offset: 0x151000 */
  __IO uint32_t CH11_ES;                           /**< Channel Error Status, offset: 0x151004 */
  __IO uint32_t CH11_INT;                          /**< Channel Interrupt Status, offset: 0x151008 */
  __IO uint32_t CH11_SBR;                          /**< Channel System Bus, offset: 0x15100C */
  __IO uint32_t CH11_PRI;                          /**< Channel Priority, offset: 0x151010 */
  uint8_t RESERVED_20[12];
  __IO uint32_t TCD11_SADDR;                       /**< TCD Source Address, offset: 0x151020 */
  __IO uint16_t TCD11_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x151024 */
  __IO uint16_t TCD11_ATTR;                        /**< TCD Transfer Attributes, offset: 0x151026 */
  union {                                          /* offset: 0x151028 */
    __IO uint32_t TCD11_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x151028 */
    __IO uint32_t TCD11_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x151028 */
  } NBYTES11;
  __IO uint32_t TCD11_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x15102C */
  __IO uint32_t TCD11_DADDR;                       /**< TCD Destination Address, offset: 0x151030 */
  __IO uint16_t TCD11_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x151034 */
  union {                                          /* offset: 0x151036 */
    __IO uint16_t TCD11_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x151036 */
    __IO uint16_t TCD11_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x151036 */
  } CITER11;
  __IO uint32_t TCD11_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x151038 */
  __IO uint16_t TCD11_CSR;                         /**< TCD Control and Status, offset: 0x15103C */
  union {                                          /* offset: 0x15103E */
    __IO uint16_t TCD11_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x15103E */
    __IO uint16_t TCD11_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x15103E */
  } BITER11;
  uint8_t RESERVED_21[4032];
  __IO uint32_t CH19_CSR;                          /**< Channel Control and Status, offset: 0x152000 */
  __IO uint32_t CH19_ES;                           /**< Channel Error Status, offset: 0x152004 */
  __IO uint32_t CH19_INT;                          /**< Channel Interrupt Status, offset: 0x152008 */
  __IO uint32_t CH19_SBR;                          /**< Channel System Bus, offset: 0x15200C */
  __IO uint32_t CH19_PRI;                          /**< Channel Priority, offset: 0x152010 */
  uint8_t RESERVED_22[12];
  __IO uint32_t TCD19_SADDR;                       /**< TCD Source Address, offset: 0x152020 */
  __IO uint16_t TCD19_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x152024 */
  __IO uint16_t TCD19_ATTR;                        /**< TCD Transfer Attributes, offset: 0x152026 */
  union {                                          /* offset: 0x152028 */
    __IO uint32_t TCD19_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x152028 */
    __IO uint32_t TCD19_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x152028 */
  } NBYTES19;
  __IO uint32_t TCD19_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x15202C */
  __IO uint32_t TCD19_DADDR;                       /**< TCD Destination Address, offset: 0x152030 */
  __IO uint16_t TCD19_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x152034 */
  union {                                          /* offset: 0x152036 */
    __IO uint16_t TCD19_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x152036 */
    __IO uint16_t TCD19_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x152036 */
  } CITER19;
  __IO uint32_t TCD19_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x152038 */
  __IO uint16_t TCD19_CSR;                         /**< TCD Control and Status, offset: 0x15203C */
  union {                                          /* offset: 0x15203E */
    __IO uint16_t TCD19_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x15203E */
    __IO uint16_t TCD19_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x15203E */
  } BITER19;
  uint8_t RESERVED_23[57280];
  __IO uint32_t CH4_CSR;                           /**< Channel Control and Status, offset: 0x160000 */
  __IO uint32_t CH4_ES;                            /**< Channel Error Status, offset: 0x160004 */
  __IO uint32_t CH4_INT;                           /**< Channel Interrupt Status, offset: 0x160008 */
  __IO uint32_t CH4_SBR;                           /**< Channel System Bus, offset: 0x16000C */
  __IO uint32_t CH4_PRI;                           /**< Channel Priority, offset: 0x160010 */
  uint8_t RESERVED_24[12];
  __IO uint32_t TCD4_SADDR;                        /**< TCD Source Address, offset: 0x160020 */
  __IO uint16_t TCD4_SOFF;                         /**< TCD Signed Source Address Offset, offset: 0x160024 */
  __IO uint16_t TCD4_ATTR;                         /**< TCD Transfer Attributes, offset: 0x160026 */
  union {                                          /* offset: 0x160028 */
    __IO uint32_t TCD4_NBYTES_MLOFFNO;               /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x160028 */
    __IO uint32_t TCD4_NBYTES_MLOFFYES;              /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x160028 */
  } NBYTES4;
  __IO uint32_t TCD4_SLAST_SDA;                    /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x16002C */
  __IO uint32_t TCD4_DADDR;                        /**< TCD Destination Address, offset: 0x160030 */
  __IO uint16_t TCD4_DOFF;                         /**< TCD Signed Destination Address Offset, offset: 0x160034 */
  union {                                          /* offset: 0x160036 */
    __IO uint16_t TCD4_CITER_ELINKNO;                /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x160036 */
    __IO uint16_t TCD4_CITER_ELINKYES;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x160036 */
  } CITER4;
  __IO uint32_t TCD4_DLAST_SGA;                    /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x160038 */
  __IO uint16_t TCD4_CSR;                          /**< TCD Control and Status, offset: 0x16003C */
  union {                                          /* offset: 0x16003E */
    __IO uint16_t TCD4_BITER_ELINKNO;                /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x16003E */
    __IO uint16_t TCD4_BITER_ELINKYES;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x16003E */
  } BITER4;
  uint8_t RESERVED_25[4032];
  __IO uint32_t CH12_CSR;                          /**< Channel Control and Status, offset: 0x161000 */
  __IO uint32_t CH12_ES;                           /**< Channel Error Status, offset: 0x161004 */
  __IO uint32_t CH12_INT;                          /**< Channel Interrupt Status, offset: 0x161008 */
  __IO uint32_t CH12_SBR;                          /**< Channel System Bus, offset: 0x16100C */
  __IO uint32_t CH12_PRI;                          /**< Channel Priority, offset: 0x161010 */
  uint8_t RESERVED_26[12];
  __IO uint32_t TCD12_SADDR;                       /**< TCD Source Address, offset: 0x161020 */
  __IO uint16_t TCD12_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x161024 */
  __IO uint16_t TCD12_ATTR;                        /**< TCD Transfer Attributes, offset: 0x161026 */
  union {                                          /* offset: 0x161028 */
    __IO uint32_t TCD12_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x161028 */
    __IO uint32_t TCD12_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x161028 */
  } NBYTES12;
  __IO uint32_t TCD12_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x16102C */
  __IO uint32_t TCD12_DADDR;                       /**< TCD Destination Address, offset: 0x161030 */
  __IO uint16_t TCD12_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x161034 */
  union {                                          /* offset: 0x161036 */
    __IO uint16_t TCD12_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x161036 */
    __IO uint16_t TCD12_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x161036 */
  } CITER12;
  __IO uint32_t TCD12_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x161038 */
  __IO uint16_t TCD12_CSR;                         /**< TCD Control and Status, offset: 0x16103C */
  union {                                          /* offset: 0x16103E */
    __IO uint16_t TCD12_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x16103E */
    __IO uint16_t TCD12_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x16103E */
  } BITER12;
  uint8_t RESERVED_27[4032];
  __IO uint32_t CH20_CSR;                          /**< Channel Control and Status, offset: 0x162000 */
  __IO uint32_t CH20_ES;                           /**< Channel Error Status, offset: 0x162004 */
  __IO uint32_t CH20_INT;                          /**< Channel Interrupt Status, offset: 0x162008 */
  __IO uint32_t CH20_SBR;                          /**< Channel System Bus, offset: 0x16200C */
  __IO uint32_t CH20_PRI;                          /**< Channel Priority, offset: 0x162010 */
  uint8_t RESERVED_28[12];
  __IO uint32_t TCD20_SADDR;                       /**< TCD Source Address, offset: 0x162020 */
  __IO uint16_t TCD20_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x162024 */
  __IO uint16_t TCD20_ATTR;                        /**< TCD Transfer Attributes, offset: 0x162026 */
  union {                                          /* offset: 0x162028 */
    __IO uint32_t TCD20_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x162028 */
    __IO uint32_t TCD20_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x162028 */
  } NBYTES20;
  __IO uint32_t TCD20_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x16202C */
  __IO uint32_t TCD20_DADDR;                       /**< TCD Destination Address, offset: 0x162030 */
  __IO uint16_t TCD20_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x162034 */
  union {                                          /* offset: 0x162036 */
    __IO uint16_t TCD20_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x162036 */
    __IO uint16_t TCD20_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x162036 */
  } CITER20;
  __IO uint32_t TCD20_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x162038 */
  __IO uint16_t TCD20_CSR;                         /**< TCD Control and Status, offset: 0x16203C */
  union {                                          /* offset: 0x16203E */
    __IO uint16_t TCD20_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x16203E */
    __IO uint16_t TCD20_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x16203E */
  } BITER20;
  uint8_t RESERVED_29[57280];
  __IO uint32_t CH5_CSR;                           /**< Channel Control and Status, offset: 0x170000 */
  __IO uint32_t CH5_ES;                            /**< Channel Error Status, offset: 0x170004 */
  __IO uint32_t CH5_INT;                           /**< Channel Interrupt Status, offset: 0x170008 */
  __IO uint32_t CH5_SBR;                           /**< Channel System Bus, offset: 0x17000C */
  __IO uint32_t CH5_PRI;                           /**< Channel Priority, offset: 0x170010 */
  uint8_t RESERVED_30[12];
  __IO uint32_t TCD5_SADDR;                        /**< TCD Source Address, offset: 0x170020 */
  __IO uint16_t TCD5_SOFF;                         /**< TCD Signed Source Address Offset, offset: 0x170024 */
  __IO uint16_t TCD5_ATTR;                         /**< TCD Transfer Attributes, offset: 0x170026 */
  union {                                          /* offset: 0x170028 */
    __IO uint32_t TCD5_NBYTES_MLOFFNO;               /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x170028 */
    __IO uint32_t TCD5_NBYTES_MLOFFYES;              /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x170028 */
  } NBYTES5;
  __IO uint32_t TCD5_SLAST_SDA;                    /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x17002C */
  __IO uint32_t TCD5_DADDR;                        /**< TCD Destination Address, offset: 0x170030 */
  __IO uint16_t TCD5_DOFF;                         /**< TCD Signed Destination Address Offset, offset: 0x170034 */
  union {                                          /* offset: 0x170036 */
    __IO uint16_t TCD5_CITER_ELINKNO;                /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x170036 */
    __IO uint16_t TCD5_CITER_ELINKYES;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x170036 */
  } CITER5;
  __IO uint32_t TCD5_DLAST_SGA;                    /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x170038 */
  __IO uint16_t TCD5_CSR;                          /**< TCD Control and Status, offset: 0x17003C */
  union {                                          /* offset: 0x17003E */
    __IO uint16_t TCD5_BITER_ELINKNO;                /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x17003E */
    __IO uint16_t TCD5_BITER_ELINKYES;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x17003E */
  } BITER5;
  uint8_t RESERVED_31[4032];
  __IO uint32_t CH13_CSR;                          /**< Channel Control and Status, offset: 0x171000 */
  __IO uint32_t CH13_ES;                           /**< Channel Error Status, offset: 0x171004 */
  __IO uint32_t CH13_INT;                          /**< Channel Interrupt Status, offset: 0x171008 */
  __IO uint32_t CH13_SBR;                          /**< Channel System Bus, offset: 0x17100C */
  __IO uint32_t CH13_PRI;                          /**< Channel Priority, offset: 0x171010 */
  uint8_t RESERVED_32[12];
  __IO uint32_t TCD13_SADDR;                       /**< TCD Source Address, offset: 0x171020 */
  __IO uint16_t TCD13_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x171024 */
  __IO uint16_t TCD13_ATTR;                        /**< TCD Transfer Attributes, offset: 0x171026 */
  union {                                          /* offset: 0x171028 */
    __IO uint32_t TCD13_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x171028 */
    __IO uint32_t TCD13_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x171028 */
  } NBYTES13;
  __IO uint32_t TCD13_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x17102C */
  __IO uint32_t TCD13_DADDR;                       /**< TCD Destination Address, offset: 0x171030 */
  __IO uint16_t TCD13_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x171034 */
  union {                                          /* offset: 0x171036 */
    __IO uint16_t TCD13_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x171036 */
    __IO uint16_t TCD13_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x171036 */
  } CITER13;
  __IO uint32_t TCD13_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x171038 */
  __IO uint16_t TCD13_CSR;                         /**< TCD Control and Status, offset: 0x17103C */
  union {                                          /* offset: 0x17103E */
    __IO uint16_t TCD13_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x17103E */
    __IO uint16_t TCD13_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x17103E */
  } BITER13;
  uint8_t RESERVED_33[4032];
  __IO uint32_t CH21_CSR;                          /**< Channel Control and Status, offset: 0x172000 */
  __IO uint32_t CH21_ES;                           /**< Channel Error Status, offset: 0x172004 */
  __IO uint32_t CH21_INT;                          /**< Channel Interrupt Status, offset: 0x172008 */
  __IO uint32_t CH21_SBR;                          /**< Channel System Bus, offset: 0x17200C */
  __IO uint32_t CH21_PRI;                          /**< Channel Priority, offset: 0x172010 */
  uint8_t RESERVED_34[12];
  __IO uint32_t TCD21_SADDR;                       /**< TCD Source Address, offset: 0x172020 */
  __IO uint16_t TCD21_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x172024 */
  __IO uint16_t TCD21_ATTR;                        /**< TCD Transfer Attributes, offset: 0x172026 */
  union {                                          /* offset: 0x172028 */
    __IO uint32_t TCD21_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x172028 */
    __IO uint32_t TCD21_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x172028 */
  } NBYTES21;
  __IO uint32_t TCD21_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x17202C */
  __IO uint32_t TCD21_DADDR;                       /**< TCD Destination Address, offset: 0x172030 */
  __IO uint16_t TCD21_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x172034 */
  union {                                          /* offset: 0x172036 */
