rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_RESULT_DMA_TCD.h
    __IO uint16_t TCD21_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x172036 */
    __IO uint16_t TCD21_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x172036 */
  } CITER21;
  __IO uint32_t TCD21_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x172038 */
  __IO uint16_t TCD21_CSR;                         /**< TCD Control and Status, offset: 0x17203C */
  union {                                          /* offset: 0x17203E */
    __IO uint16_t TCD21_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x17203E */
    __IO uint16_t TCD21_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x17203E */
  } BITER21;
  uint8_t RESERVED_35[57280];
  __IO uint32_t CH6_CSR;                           /**< Channel Control and Status, offset: 0x180000 */
  __IO uint32_t CH6_ES;                            /**< Channel Error Status, offset: 0x180004 */
  __IO uint32_t CH6_INT;                           /**< Channel Interrupt Status, offset: 0x180008 */
  __IO uint32_t CH6_SBR;                           /**< Channel System Bus, offset: 0x18000C */
  __IO uint32_t CH6_PRI;                           /**< Channel Priority, offset: 0x180010 */
  uint8_t RESERVED_36[12];
  __IO uint32_t TCD6_SADDR;                        /**< TCD Source Address, offset: 0x180020 */
  __IO uint16_t TCD6_SOFF;                         /**< TCD Signed Source Address Offset, offset: 0x180024 */
  __IO uint16_t TCD6_ATTR;                         /**< TCD Transfer Attributes, offset: 0x180026 */
  union {                                          /* offset: 0x180028 */
    __IO uint32_t TCD6_NBYTES_MLOFFNO;               /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x180028 */
    __IO uint32_t TCD6_NBYTES_MLOFFYES;              /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x180028 */
  } NBYTES6;
  __IO uint32_t TCD6_SLAST_SDA;                    /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x18002C */
  __IO uint32_t TCD6_DADDR;                        /**< TCD Destination Address, offset: 0x180030 */
  __IO uint16_t TCD6_DOFF;                         /**< TCD Signed Destination Address Offset, offset: 0x180034 */
  union {                                          /* offset: 0x180036 */
    __IO uint16_t TCD6_CITER_ELINKNO;                /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x180036 */
    __IO uint16_t TCD6_CITER_ELINKYES;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x180036 */
  } CITER6;
  __IO uint32_t TCD6_DLAST_SGA;                    /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x180038 */
  __IO uint16_t TCD6_CSR;                          /**< TCD Control and Status, offset: 0x18003C */
  union {                                          /* offset: 0x18003E */
    __IO uint16_t TCD6_BITER_ELINKNO;                /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x18003E */
    __IO uint16_t TCD6_BITER_ELINKYES;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x18003E */
  } BITER6;
  uint8_t RESERVED_37[4032];
  __IO uint32_t CH14_CSR;                          /**< Channel Control and Status, offset: 0x181000 */
  __IO uint32_t CH14_ES;                           /**< Channel Error Status, offset: 0x181004 */
  __IO uint32_t CH14_INT;                          /**< Channel Interrupt Status, offset: 0x181008 */
  __IO uint32_t CH14_SBR;                          /**< Channel System Bus, offset: 0x18100C */
  __IO uint32_t CH14_PRI;                          /**< Channel Priority, offset: 0x181010 */
  uint8_t RESERVED_38[12];
  __IO uint32_t TCD14_SADDR;                       /**< TCD Source Address, offset: 0x181020 */
  __IO uint16_t TCD14_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x181024 */
  __IO uint16_t TCD14_ATTR;                        /**< TCD Transfer Attributes, offset: 0x181026 */
  union {                                          /* offset: 0x181028 */
    __IO uint32_t TCD14_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x181028 */
    __IO uint32_t TCD14_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x181028 */
  } NBYTES14;
  __IO uint32_t TCD14_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x18102C */
  __IO uint32_t TCD14_DADDR;                       /**< TCD Destination Address, offset: 0x181030 */
  __IO uint16_t TCD14_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x181034 */
  union {                                          /* offset: 0x181036 */
    __IO uint16_t TCD14_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x181036 */
    __IO uint16_t TCD14_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x181036 */
  } CITER14;
  __IO uint32_t TCD14_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x181038 */
  __IO uint16_t TCD14_CSR;                         /**< TCD Control and Status, offset: 0x18103C */
  union {                                          /* offset: 0x18103E */
    __IO uint16_t TCD14_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x18103E */
    __IO uint16_t TCD14_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x18103E */
  } BITER14;
  uint8_t RESERVED_39[4032];
  __IO uint32_t CH22_CSR;                          /**< Channel Control and Status, offset: 0x182000 */
  __IO uint32_t CH22_ES;                           /**< Channel Error Status, offset: 0x182004 */
  __IO uint32_t CH22_INT;                          /**< Channel Interrupt Status, offset: 0x182008 */
  __IO uint32_t CH22_SBR;                          /**< Channel System Bus, offset: 0x18200C */
  __IO uint32_t CH22_PRI;                          /**< Channel Priority, offset: 0x182010 */
  uint8_t RESERVED_40[12];
  __IO uint32_t TCD22_SADDR;                       /**< TCD Source Address, offset: 0x182020 */
  __IO uint16_t TCD22_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x182024 */
  __IO uint16_t TCD22_ATTR;                        /**< TCD Transfer Attributes, offset: 0x182026 */
  union {                                          /* offset: 0x182028 */
    __IO uint32_t TCD22_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x182028 */
    __IO uint32_t TCD22_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x182028 */
  } NBYTES22;
  __IO uint32_t TCD22_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x18202C */
  __IO uint32_t TCD22_DADDR;                       /**< TCD Destination Address, offset: 0x182030 */
  __IO uint16_t TCD22_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x182034 */
  union {                                          /* offset: 0x182036 */
    __IO uint16_t TCD22_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x182036 */
    __IO uint16_t TCD22_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x182036 */
  } CITER22;
  __IO uint32_t TCD22_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x182038 */
  __IO uint16_t TCD22_CSR;                         /**< TCD Control and Status, offset: 0x18203C */
  union {                                          /* offset: 0x18203E */
    __IO uint16_t TCD22_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x18203E */
    __IO uint16_t TCD22_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x18203E */
  } BITER22;
  uint8_t RESERVED_41[57280];
  __IO uint32_t CH7_CSR;                           /**< Channel Control and Status, offset: 0x190000 */
  __IO uint32_t CH7_ES;                            /**< Channel Error Status, offset: 0x190004 */
  __IO uint32_t CH7_INT;                           /**< Channel Interrupt Status, offset: 0x190008 */
  __IO uint32_t CH7_SBR;                           /**< Channel System Bus, offset: 0x19000C */
  __IO uint32_t CH7_PRI;                           /**< Channel Priority, offset: 0x190010 */
  uint8_t RESERVED_42[12];
  __IO uint32_t TCD7_SADDR;                        /**< TCD Source Address, offset: 0x190020 */
  __IO uint16_t TCD7_SOFF;                         /**< TCD Signed Source Address Offset, offset: 0x190024 */
  __IO uint16_t TCD7_ATTR;                         /**< TCD Transfer Attributes, offset: 0x190026 */
  union {                                          /* offset: 0x190028 */
    __IO uint32_t TCD7_NBYTES_MLOFFNO;               /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x190028 */
    __IO uint32_t TCD7_NBYTES_MLOFFYES;              /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x190028 */
  } NBYTES7;
  __IO uint32_t TCD7_SLAST_SDA;                    /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x19002C */
  __IO uint32_t TCD7_DADDR;                        /**< TCD Destination Address, offset: 0x190030 */
  __IO uint16_t TCD7_DOFF;                         /**< TCD Signed Destination Address Offset, offset: 0x190034 */
  union {                                          /* offset: 0x190036 */
    __IO uint16_t TCD7_CITER_ELINKNO;                /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x190036 */
    __IO uint16_t TCD7_CITER_ELINKYES;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x190036 */
  } CITER7;
  __IO uint32_t TCD7_DLAST_SGA;                    /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x190038 */
  __IO uint16_t TCD7_CSR;                          /**< TCD Control and Status, offset: 0x19003C */
  union {                                          /* offset: 0x19003E */
    __IO uint16_t TCD7_BITER_ELINKNO;                /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x19003E */
    __IO uint16_t TCD7_BITER_ELINKYES;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x19003E */
  } BITER7;
  uint8_t RESERVED_43[4032];
  __IO uint32_t CH15_CSR;                          /**< Channel Control and Status, offset: 0x191000 */
  __IO uint32_t CH15_ES;                           /**< Channel Error Status, offset: 0x191004 */
  __IO uint32_t CH15_INT;                          /**< Channel Interrupt Status, offset: 0x191008 */
  __IO uint32_t CH15_SBR;                          /**< Channel System Bus, offset: 0x19100C */
  __IO uint32_t CH15_PRI;                          /**< Channel Priority, offset: 0x191010 */
  uint8_t RESERVED_44[12];
  __IO uint32_t TCD15_SADDR;                       /**< TCD Source Address, offset: 0x191020 */
  __IO uint16_t TCD15_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x191024 */
  __IO uint16_t TCD15_ATTR;                        /**< TCD Transfer Attributes, offset: 0x191026 */
  union {                                          /* offset: 0x191028 */
    __IO uint32_t TCD15_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x191028 */
    __IO uint32_t TCD15_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x191028 */
  } NBYTES15;
  __IO uint32_t TCD15_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x19102C */
  __IO uint32_t TCD15_DADDR;                       /**< TCD Destination Address, offset: 0x191030 */
  __IO uint16_t TCD15_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x191034 */
  union {                                          /* offset: 0x191036 */
    __IO uint16_t TCD15_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x191036 */
    __IO uint16_t TCD15_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x191036 */
  } CITER15;
  __IO uint32_t TCD15_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x191038 */
  __IO uint16_t TCD15_CSR;                         /**< TCD Control and Status, offset: 0x19103C */
  union {                                          /* offset: 0x19103E */
    __IO uint16_t TCD15_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x19103E */
    __IO uint16_t TCD15_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x19103E */
  } BITER15;
  uint8_t RESERVED_45[4032];
  __IO uint32_t CH23_CSR;                          /**< Channel Control and Status, offset: 0x192000 */
  __IO uint32_t CH23_ES;                           /**< Channel Error Status, offset: 0x192004 */
  __IO uint32_t CH23_INT;                          /**< Channel Interrupt Status, offset: 0x192008 */
  __IO uint32_t CH23_SBR;                          /**< Channel System Bus, offset: 0x19200C */
  __IO uint32_t CH23_PRI;                          /**< Channel Priority, offset: 0x192010 */
  uint8_t RESERVED_46[12];
  __IO uint32_t TCD23_SADDR;                       /**< TCD Source Address, offset: 0x192020 */
  __IO uint16_t TCD23_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x192024 */
  __IO uint16_t TCD23_ATTR;                        /**< TCD Transfer Attributes, offset: 0x192026 */
  union {                                          /* offset: 0x192028 */
    __IO uint32_t TCD23_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x192028 */
    __IO uint32_t TCD23_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x192028 */
  } NBYTES23;
  __IO uint32_t TCD23_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x19202C */
  __IO uint32_t TCD23_DADDR;                       /**< TCD Destination Address, offset: 0x192030 */
  __IO uint16_t TCD23_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x192034 */
  union {                                          /* offset: 0x192036 */
    __IO uint16_t TCD23_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x192036 */
    __IO uint16_t TCD23_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x192036 */
  } CITER23;
  __IO uint32_t TCD23_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x192038 */
  __IO uint16_t TCD23_CSR;                         /**< TCD Control and Status, offset: 0x19203C */
  union {                                          /* offset: 0x19203E */
    __IO uint16_t TCD23_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x19203E */
    __IO uint16_t TCD23_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x19203E */
  } BITER23;
} RESULT_DMA_TCD_Type, *RESULT_DMA_TCD_MemMapPtr;

/** Number of instances of the RESULT_DMA_TCD module. */
#define RESULT_DMA_TCD_INSTANCE_COUNT            (1u)

/* RESULT_DMA_TCD - Peripheral instance base addresses */
/** Peripheral RESULT_DMA_TCD base address */
#define IP_RESULT_DMA_TCD_BASE                   (0x403D5000u)
/** Peripheral RESULT_DMA_TCD base pointer */
#define IP_RESULT_DMA_TCD                        ((RESULT_DMA_TCD_Type *)IP_RESULT_DMA_TCD_BASE)
/** Array initializer of RESULT_DMA_TCD peripheral base addresses */
#define IP_RESULT_DMA_TCD_BASE_ADDRS             { IP_RESULT_DMA_TCD_BASE }
/** Array initializer of RESULT_DMA_TCD peripheral base pointers */
#define IP_RESULT_DMA_TCD_BASE_PTRS              { IP_RESULT_DMA_TCD }

/* ----------------------------------------------------------------------------
   -- RESULT_DMA_TCD Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RESULT_DMA_TCD_Register_Masks RESULT_DMA_TCD Register Masks
 * @{
 */

/*! @name CH0_CSR - Channel Control and Status */
/*! @{ */

