rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_RESULT_DMA_TCD.h
#define RESULT_DMA_TCD_CH3_CSR_ERQ_MASK          (0x1U)
#define RESULT_DMA_TCD_CH3_CSR_ERQ_SHIFT         (0U)
#define RESULT_DMA_TCD_CH3_CSR_ERQ_WIDTH         (1U)
#define RESULT_DMA_TCD_CH3_CSR_ERQ(x)            (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH3_CSR_ERQ_SHIFT)) & RESULT_DMA_TCD_CH3_CSR_ERQ_MASK)

#define RESULT_DMA_TCD_CH3_CSR_EARQ_MASK         (0x2U)
#define RESULT_DMA_TCD_CH3_CSR_EARQ_SHIFT        (1U)
#define RESULT_DMA_TCD_CH3_CSR_EARQ_WIDTH        (1U)
#define RESULT_DMA_TCD_CH3_CSR_EARQ(x)           (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH3_CSR_EARQ_SHIFT)) & RESULT_DMA_TCD_CH3_CSR_EARQ_MASK)

#define RESULT_DMA_TCD_CH3_CSR_EEI_MASK          (0x4U)
#define RESULT_DMA_TCD_CH3_CSR_EEI_SHIFT         (2U)
#define RESULT_DMA_TCD_CH3_CSR_EEI_WIDTH         (1U)
#define RESULT_DMA_TCD_CH3_CSR_EEI(x)            (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH3_CSR_EEI_SHIFT)) & RESULT_DMA_TCD_CH3_CSR_EEI_MASK)

#define RESULT_DMA_TCD_CH3_CSR_DONE_MASK         (0x40000000U)
#define RESULT_DMA_TCD_CH3_CSR_DONE_SHIFT        (30U)
#define RESULT_DMA_TCD_CH3_CSR_DONE_WIDTH        (1U)
#define RESULT_DMA_TCD_CH3_CSR_DONE(x)           (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH3_CSR_DONE_SHIFT)) & RESULT_DMA_TCD_CH3_CSR_DONE_MASK)

#define RESULT_DMA_TCD_CH3_CSR_ACTIVE_MASK       (0x80000000U)
#define RESULT_DMA_TCD_CH3_CSR_ACTIVE_SHIFT      (31U)
#define RESULT_DMA_TCD_CH3_CSR_ACTIVE_WIDTH      (1U)
#define RESULT_DMA_TCD_CH3_CSR_ACTIVE(x)         (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH3_CSR_ACTIVE_SHIFT)) & RESULT_DMA_TCD_CH3_CSR_ACTIVE_MASK)
/*! @} */

/*! @name CH3_ES - Channel Error Status */
/*! @{ */

#define RESULT_DMA_TCD_CH3_ES_DBE_MASK           (0x1U)
#define RESULT_DMA_TCD_CH3_ES_DBE_SHIFT          (0U)
#define RESULT_DMA_TCD_CH3_ES_DBE_WIDTH          (1U)
#define RESULT_DMA_TCD_CH3_ES_DBE(x)             (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH3_ES_DBE_SHIFT)) & RESULT_DMA_TCD_CH3_ES_DBE_MASK)

#define RESULT_DMA_TCD_CH3_ES_SBE_MASK           (0x2U)
#define RESULT_DMA_TCD_CH3_ES_SBE_SHIFT          (1U)
#define RESULT_DMA_TCD_CH3_ES_SBE_WIDTH          (1U)
#define RESULT_DMA_TCD_CH3_ES_SBE(x)             (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH3_ES_SBE_SHIFT)) & RESULT_DMA_TCD_CH3_ES_SBE_MASK)

#define RESULT_DMA_TCD_CH3_ES_SGE_MASK           (0x4U)
#define RESULT_DMA_TCD_CH3_ES_SGE_SHIFT          (2U)
#define RESULT_DMA_TCD_CH3_ES_SGE_WIDTH          (1U)
#define RESULT_DMA_TCD_CH3_ES_SGE(x)             (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH3_ES_SGE_SHIFT)) & RESULT_DMA_TCD_CH3_ES_SGE_MASK)

#define RESULT_DMA_TCD_CH3_ES_NCE_MASK           (0x8U)
#define RESULT_DMA_TCD_CH3_ES_NCE_SHIFT          (3U)
#define RESULT_DMA_TCD_CH3_ES_NCE_WIDTH          (1U)
#define RESULT_DMA_TCD_CH3_ES_NCE(x)             (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH3_ES_NCE_SHIFT)) & RESULT_DMA_TCD_CH3_ES_NCE_MASK)

#define RESULT_DMA_TCD_CH3_ES_DOE_MASK           (0x10U)
#define RESULT_DMA_TCD_CH3_ES_DOE_SHIFT          (4U)
#define RESULT_DMA_TCD_CH3_ES_DOE_WIDTH          (1U)
#define RESULT_DMA_TCD_CH3_ES_DOE(x)             (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH3_ES_DOE_SHIFT)) & RESULT_DMA_TCD_CH3_ES_DOE_MASK)

#define RESULT_DMA_TCD_CH3_ES_DAE_MASK           (0x20U)
#define RESULT_DMA_TCD_CH3_ES_DAE_SHIFT          (5U)
#define RESULT_DMA_TCD_CH3_ES_DAE_WIDTH          (1U)
#define RESULT_DMA_TCD_CH3_ES_DAE(x)             (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH3_ES_DAE_SHIFT)) & RESULT_DMA_TCD_CH3_ES_DAE_MASK)

#define RESULT_DMA_TCD_CH3_ES_SOE_MASK           (0x40U)
#define RESULT_DMA_TCD_CH3_ES_SOE_SHIFT          (6U)
#define RESULT_DMA_TCD_CH3_ES_SOE_WIDTH          (1U)
#define RESULT_DMA_TCD_CH3_ES_SOE(x)             (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH3_ES_SOE_SHIFT)) & RESULT_DMA_TCD_CH3_ES_SOE_MASK)

#define RESULT_DMA_TCD_CH3_ES_SAE_MASK           (0x80U)
#define RESULT_DMA_TCD_CH3_ES_SAE_SHIFT          (7U)
#define RESULT_DMA_TCD_CH3_ES_SAE_WIDTH          (1U)
#define RESULT_DMA_TCD_CH3_ES_SAE(x)             (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH3_ES_SAE_SHIFT)) & RESULT_DMA_TCD_CH3_ES_SAE_MASK)

#define RESULT_DMA_TCD_CH3_ES_ERR_MASK           (0x80000000U)
#define RESULT_DMA_TCD_CH3_ES_ERR_SHIFT          (31U)
#define RESULT_DMA_TCD_CH3_ES_ERR_WIDTH          (1U)
#define RESULT_DMA_TCD_CH3_ES_ERR(x)             (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH3_ES_ERR_SHIFT)) & RESULT_DMA_TCD_CH3_ES_ERR_MASK)
/*! @} */

/*! @name CH3_INT - Channel Interrupt Status */
/*! @{ */

#define RESULT_DMA_TCD_CH3_INT_INT_MASK          (0x1U)
#define RESULT_DMA_TCD_CH3_INT_INT_SHIFT         (0U)
#define RESULT_DMA_TCD_CH3_INT_INT_WIDTH         (1U)
#define RESULT_DMA_TCD_CH3_INT_INT(x)            (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH3_INT_INT_SHIFT)) & RESULT_DMA_TCD_CH3_INT_INT_MASK)
/*! @} */

/*! @name CH3_SBR - Channel System Bus */
/*! @{ */

#define RESULT_DMA_TCD_CH3_SBR_MID_MASK          (0x3FU)
#define RESULT_DMA_TCD_CH3_SBR_MID_SHIFT         (0U)
#define RESULT_DMA_TCD_CH3_SBR_MID_WIDTH         (6U)
#define RESULT_DMA_TCD_CH3_SBR_MID(x)            (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH3_SBR_MID_SHIFT)) & RESULT_DMA_TCD_CH3_SBR_MID_MASK)

#define RESULT_DMA_TCD_CH3_SBR_PAL_MASK          (0x8000U)
#define RESULT_DMA_TCD_CH3_SBR_PAL_SHIFT         (15U)
#define RESULT_DMA_TCD_CH3_SBR_PAL_WIDTH         (1U)
#define RESULT_DMA_TCD_CH3_SBR_PAL(x)            (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH3_SBR_PAL_SHIFT)) & RESULT_DMA_TCD_CH3_SBR_PAL_MASK)

#define RESULT_DMA_TCD_CH3_SBR_EMI_MASK          (0x10000U)
#define RESULT_DMA_TCD_CH3_SBR_EMI_SHIFT         (16U)
#define RESULT_DMA_TCD_CH3_SBR_EMI_WIDTH         (1U)
#define RESULT_DMA_TCD_CH3_SBR_EMI(x)            (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH3_SBR_EMI_SHIFT)) & RESULT_DMA_TCD_CH3_SBR_EMI_MASK)

#define RESULT_DMA_TCD_CH3_SBR_ATTR_MASK         (0xE0000U)
#define RESULT_DMA_TCD_CH3_SBR_ATTR_SHIFT        (17U)
#define RESULT_DMA_TCD_CH3_SBR_ATTR_WIDTH        (3U)
#define RESULT_DMA_TCD_CH3_SBR_ATTR(x)           (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH3_SBR_ATTR_SHIFT)) & RESULT_DMA_TCD_CH3_SBR_ATTR_MASK)
/*! @} */

/*! @name CH3_PRI - Channel Priority */
/*! @{ */

#define RESULT_DMA_TCD_CH3_PRI_APL_MASK          (0x7U)
#define RESULT_DMA_TCD_CH3_PRI_APL_SHIFT         (0U)
#define RESULT_DMA_TCD_CH3_PRI_APL_WIDTH         (3U)
#define RESULT_DMA_TCD_CH3_PRI_APL(x)            (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH3_PRI_APL_SHIFT)) & RESULT_DMA_TCD_CH3_PRI_APL_MASK)

#define RESULT_DMA_TCD_CH3_PRI_DPA_MASK          (0x40000000U)
#define RESULT_DMA_TCD_CH3_PRI_DPA_SHIFT         (30U)
#define RESULT_DMA_TCD_CH3_PRI_DPA_WIDTH         (1U)
#define RESULT_DMA_TCD_CH3_PRI_DPA(x)            (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH3_PRI_DPA_SHIFT)) & RESULT_DMA_TCD_CH3_PRI_DPA_MASK)

#define RESULT_DMA_TCD_CH3_PRI_ECP_MASK          (0x80000000U)
#define RESULT_DMA_TCD_CH3_PRI_ECP_SHIFT         (31U)
#define RESULT_DMA_TCD_CH3_PRI_ECP_WIDTH         (1U)
#define RESULT_DMA_TCD_CH3_PRI_ECP(x)            (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH3_PRI_ECP_SHIFT)) & RESULT_DMA_TCD_CH3_PRI_ECP_MASK)
/*! @} */

/*! @name TCD3_SADDR - TCD Source Address */
/*! @{ */

#define RESULT_DMA_TCD_TCD3_SADDR_SADDR_MASK     (0xFFFFFFFFU)
#define RESULT_DMA_TCD_TCD3_SADDR_SADDR_SHIFT    (0U)
#define RESULT_DMA_TCD_TCD3_SADDR_SADDR_WIDTH    (32U)
#define RESULT_DMA_TCD_TCD3_SADDR_SADDR(x)       (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_TCD3_SADDR_SADDR_SHIFT)) & RESULT_DMA_TCD_TCD3_SADDR_SADDR_MASK)
/*! @} */

/*! @name TCD3_SOFF - TCD Signed Source Address Offset */
/*! @{ */

#define RESULT_DMA_TCD_TCD3_SOFF_SOFF_MASK       (0xFFFFU)
#define RESULT_DMA_TCD_TCD3_SOFF_SOFF_SHIFT      (0U)
#define RESULT_DMA_TCD_TCD3_SOFF_SOFF_WIDTH      (16U)
#define RESULT_DMA_TCD_TCD3_SOFF_SOFF(x)         (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD3_SOFF_SOFF_SHIFT)) & RESULT_DMA_TCD_TCD3_SOFF_SOFF_MASK)
/*! @} */

/*! @name TCD3_ATTR - TCD Transfer Attributes */
/*! @{ */

#define RESULT_DMA_TCD_TCD3_ATTR_DSIZE_MASK      (0x7U)
#define RESULT_DMA_TCD_TCD3_ATTR_DSIZE_SHIFT     (0U)
#define RESULT_DMA_TCD_TCD3_ATTR_DSIZE_WIDTH     (3U)
#define RESULT_DMA_TCD_TCD3_ATTR_DSIZE(x)        (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD3_ATTR_DSIZE_SHIFT)) & RESULT_DMA_TCD_TCD3_ATTR_DSIZE_MASK)

#define RESULT_DMA_TCD_TCD3_ATTR_DMOD_MASK       (0xF8U)
#define RESULT_DMA_TCD_TCD3_ATTR_DMOD_SHIFT      (3U)
#define RESULT_DMA_TCD_TCD3_ATTR_DMOD_WIDTH      (5U)
#define RESULT_DMA_TCD_TCD3_ATTR_DMOD(x)         (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD3_ATTR_DMOD_SHIFT)) & RESULT_DMA_TCD_TCD3_ATTR_DMOD_MASK)

