rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_RESULT_DMA_TCD.h
#define RESULT_DMA_TCD_TCD12_CITER_ELINKYES_LINKCH_MASK (0x3E00U)
#define RESULT_DMA_TCD_TCD12_CITER_ELINKYES_LINKCH_SHIFT (9U)
#define RESULT_DMA_TCD_TCD12_CITER_ELINKYES_LINKCH_WIDTH (5U)
#define RESULT_DMA_TCD_TCD12_CITER_ELINKYES_LINKCH(x) (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD12_CITER_ELINKYES_LINKCH_SHIFT)) & RESULT_DMA_TCD_TCD12_CITER_ELINKYES_LINKCH_MASK)

#define RESULT_DMA_TCD_TCD12_CITER_ELINKYES_ELINK_MASK (0x8000U)
#define RESULT_DMA_TCD_TCD12_CITER_ELINKYES_ELINK_SHIFT (15U)
#define RESULT_DMA_TCD_TCD12_CITER_ELINKYES_ELINK_WIDTH (1U)
#define RESULT_DMA_TCD_TCD12_CITER_ELINKYES_ELINK(x) (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD12_CITER_ELINKYES_ELINK_SHIFT)) & RESULT_DMA_TCD_TCD12_CITER_ELINKYES_ELINK_MASK)
/*! @} */

/*! @name TCD12_DLAST_SGA - TCD Last Destination Address Adjustment / Scatter Gather Address */
/*! @{ */

#define RESULT_DMA_TCD_TCD12_DLAST_SGA_DLAST_SGA_MASK (0xFFFFFFFFU)
#define RESULT_DMA_TCD_TCD12_DLAST_SGA_DLAST_SGA_SHIFT (0U)
#define RESULT_DMA_TCD_TCD12_DLAST_SGA_DLAST_SGA_WIDTH (32U)
#define RESULT_DMA_TCD_TCD12_DLAST_SGA_DLAST_SGA(x) (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_TCD12_DLAST_SGA_DLAST_SGA_SHIFT)) & RESULT_DMA_TCD_TCD12_DLAST_SGA_DLAST_SGA_MASK)
/*! @} */

/*! @name TCD12_CSR - TCD Control and Status */
/*! @{ */

#define RESULT_DMA_TCD_TCD12_CSR_START_MASK      (0x1U)
#define RESULT_DMA_TCD_TCD12_CSR_START_SHIFT     (0U)
#define RESULT_DMA_TCD_TCD12_CSR_START_WIDTH     (1U)
#define RESULT_DMA_TCD_TCD12_CSR_START(x)        (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD12_CSR_START_SHIFT)) & RESULT_DMA_TCD_TCD12_CSR_START_MASK)

#define RESULT_DMA_TCD_TCD12_CSR_INTMAJOR_MASK   (0x2U)
#define RESULT_DMA_TCD_TCD12_CSR_INTMAJOR_SHIFT  (1U)
#define RESULT_DMA_TCD_TCD12_CSR_INTMAJOR_WIDTH  (1U)
#define RESULT_DMA_TCD_TCD12_CSR_INTMAJOR(x)     (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD12_CSR_INTMAJOR_SHIFT)) & RESULT_DMA_TCD_TCD12_CSR_INTMAJOR_MASK)

#define RESULT_DMA_TCD_TCD12_CSR_INTHALF_MASK    (0x4U)
#define RESULT_DMA_TCD_TCD12_CSR_INTHALF_SHIFT   (2U)
#define RESULT_DMA_TCD_TCD12_CSR_INTHALF_WIDTH   (1U)
#define RESULT_DMA_TCD_TCD12_CSR_INTHALF(x)      (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD12_CSR_INTHALF_SHIFT)) & RESULT_DMA_TCD_TCD12_CSR_INTHALF_MASK)

#define RESULT_DMA_TCD_TCD12_CSR_DREQ_MASK       (0x8U)
#define RESULT_DMA_TCD_TCD12_CSR_DREQ_SHIFT      (3U)
#define RESULT_DMA_TCD_TCD12_CSR_DREQ_WIDTH      (1U)
#define RESULT_DMA_TCD_TCD12_CSR_DREQ(x)         (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD12_CSR_DREQ_SHIFT)) & RESULT_DMA_TCD_TCD12_CSR_DREQ_MASK)

#define RESULT_DMA_TCD_TCD12_CSR_ESG_MASK        (0x10U)
#define RESULT_DMA_TCD_TCD12_CSR_ESG_SHIFT       (4U)
#define RESULT_DMA_TCD_TCD12_CSR_ESG_WIDTH       (1U)
#define RESULT_DMA_TCD_TCD12_CSR_ESG(x)          (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD12_CSR_ESG_SHIFT)) & RESULT_DMA_TCD_TCD12_CSR_ESG_MASK)

#define RESULT_DMA_TCD_TCD12_CSR_MAJORELINK_MASK (0x20U)
#define RESULT_DMA_TCD_TCD12_CSR_MAJORELINK_SHIFT (5U)
#define RESULT_DMA_TCD_TCD12_CSR_MAJORELINK_WIDTH (1U)
#define RESULT_DMA_TCD_TCD12_CSR_MAJORELINK(x)   (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD12_CSR_MAJORELINK_SHIFT)) & RESULT_DMA_TCD_TCD12_CSR_MAJORELINK_MASK)

#define RESULT_DMA_TCD_TCD12_CSR_ESDA_MASK       (0x80U)
#define RESULT_DMA_TCD_TCD12_CSR_ESDA_SHIFT      (7U)
#define RESULT_DMA_TCD_TCD12_CSR_ESDA_WIDTH      (1U)
#define RESULT_DMA_TCD_TCD12_CSR_ESDA(x)         (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD12_CSR_ESDA_SHIFT)) & RESULT_DMA_TCD_TCD12_CSR_ESDA_MASK)

#define RESULT_DMA_TCD_TCD12_CSR_MAJORLINKCH_MASK (0x1F00U)
#define RESULT_DMA_TCD_TCD12_CSR_MAJORLINKCH_SHIFT (8U)
#define RESULT_DMA_TCD_TCD12_CSR_MAJORLINKCH_WIDTH (5U)
#define RESULT_DMA_TCD_TCD12_CSR_MAJORLINKCH(x)  (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD12_CSR_MAJORLINKCH_SHIFT)) & RESULT_DMA_TCD_TCD12_CSR_MAJORLINKCH_MASK)

#define RESULT_DMA_TCD_TCD12_CSR_BWC_MASK        (0xC000U)
#define RESULT_DMA_TCD_TCD12_CSR_BWC_SHIFT       (14U)
#define RESULT_DMA_TCD_TCD12_CSR_BWC_WIDTH       (2U)
#define RESULT_DMA_TCD_TCD12_CSR_BWC(x)          (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD12_CSR_BWC_SHIFT)) & RESULT_DMA_TCD_TCD12_CSR_BWC_MASK)
/*! @} */

/*! @name TCD12_BITER_ELINKNO - TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled) */
/*! @{ */

#define RESULT_DMA_TCD_TCD12_BITER_ELINKNO_BITER_MASK (0x7FFFU)
#define RESULT_DMA_TCD_TCD12_BITER_ELINKNO_BITER_SHIFT (0U)
#define RESULT_DMA_TCD_TCD12_BITER_ELINKNO_BITER_WIDTH (15U)
#define RESULT_DMA_TCD_TCD12_BITER_ELINKNO_BITER(x) (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD12_BITER_ELINKNO_BITER_SHIFT)) & RESULT_DMA_TCD_TCD12_BITER_ELINKNO_BITER_MASK)

#define RESULT_DMA_TCD_TCD12_BITER_ELINKNO_ELINK_MASK (0x8000U)
#define RESULT_DMA_TCD_TCD12_BITER_ELINKNO_ELINK_SHIFT (15U)
#define RESULT_DMA_TCD_TCD12_BITER_ELINKNO_ELINK_WIDTH (1U)
#define RESULT_DMA_TCD_TCD12_BITER_ELINKNO_ELINK(x) (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD12_BITER_ELINKNO_ELINK_SHIFT)) & RESULT_DMA_TCD_TCD12_BITER_ELINKNO_ELINK_MASK)
/*! @} */

/*! @name TCD12_BITER_ELINKYES - TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled) */
/*! @{ */

#define RESULT_DMA_TCD_TCD12_BITER_ELINKYES_BITER_MASK (0x1FFU)
#define RESULT_DMA_TCD_TCD12_BITER_ELINKYES_BITER_SHIFT (0U)
#define RESULT_DMA_TCD_TCD12_BITER_ELINKYES_BITER_WIDTH (9U)
#define RESULT_DMA_TCD_TCD12_BITER_ELINKYES_BITER(x) (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD12_BITER_ELINKYES_BITER_SHIFT)) & RESULT_DMA_TCD_TCD12_BITER_ELINKYES_BITER_MASK)

#define RESULT_DMA_TCD_TCD12_BITER_ELINKYES_LINKCH_MASK (0x3E00U)
#define RESULT_DMA_TCD_TCD12_BITER_ELINKYES_LINKCH_SHIFT (9U)
#define RESULT_DMA_TCD_TCD12_BITER_ELINKYES_LINKCH_WIDTH (5U)
#define RESULT_DMA_TCD_TCD12_BITER_ELINKYES_LINKCH(x) (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD12_BITER_ELINKYES_LINKCH_SHIFT)) & RESULT_DMA_TCD_TCD12_BITER_ELINKYES_LINKCH_MASK)

#define RESULT_DMA_TCD_TCD12_BITER_ELINKYES_ELINK_MASK (0x8000U)
#define RESULT_DMA_TCD_TCD12_BITER_ELINKYES_ELINK_SHIFT (15U)
#define RESULT_DMA_TCD_TCD12_BITER_ELINKYES_ELINK_WIDTH (1U)
#define RESULT_DMA_TCD_TCD12_BITER_ELINKYES_ELINK(x) (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD12_BITER_ELINKYES_ELINK_SHIFT)) & RESULT_DMA_TCD_TCD12_BITER_ELINKYES_ELINK_MASK)
/*! @} */

/*! @name CH20_CSR - Channel Control and Status */
/*! @{ */

#define RESULT_DMA_TCD_CH20_CSR_ERQ_MASK         (0x1U)
#define RESULT_DMA_TCD_CH20_CSR_ERQ_SHIFT        (0U)
#define RESULT_DMA_TCD_CH20_CSR_ERQ_WIDTH        (1U)
#define RESULT_DMA_TCD_CH20_CSR_ERQ(x)           (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH20_CSR_ERQ_SHIFT)) & RESULT_DMA_TCD_CH20_CSR_ERQ_MASK)

#define RESULT_DMA_TCD_CH20_CSR_EARQ_MASK        (0x2U)
#define RESULT_DMA_TCD_CH20_CSR_EARQ_SHIFT       (1U)
#define RESULT_DMA_TCD_CH20_CSR_EARQ_WIDTH       (1U)
#define RESULT_DMA_TCD_CH20_CSR_EARQ(x)          (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH20_CSR_EARQ_SHIFT)) & RESULT_DMA_TCD_CH20_CSR_EARQ_MASK)

#define RESULT_DMA_TCD_CH20_CSR_EEI_MASK         (0x4U)
#define RESULT_DMA_TCD_CH20_CSR_EEI_SHIFT        (2U)
#define RESULT_DMA_TCD_CH20_CSR_EEI_WIDTH        (1U)
#define RESULT_DMA_TCD_CH20_CSR_EEI(x)           (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH20_CSR_EEI_SHIFT)) & RESULT_DMA_TCD_CH20_CSR_EEI_MASK)

#define RESULT_DMA_TCD_CH20_CSR_DONE_MASK        (0x40000000U)
#define RESULT_DMA_TCD_CH20_CSR_DONE_SHIFT       (30U)
#define RESULT_DMA_TCD_CH20_CSR_DONE_WIDTH       (1U)
#define RESULT_DMA_TCD_CH20_CSR_DONE(x)          (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH20_CSR_DONE_SHIFT)) & RESULT_DMA_TCD_CH20_CSR_DONE_MASK)

#define RESULT_DMA_TCD_CH20_CSR_ACTIVE_MASK      (0x80000000U)
#define RESULT_DMA_TCD_CH20_CSR_ACTIVE_SHIFT     (31U)
#define RESULT_DMA_TCD_CH20_CSR_ACTIVE_WIDTH     (1U)
#define RESULT_DMA_TCD_CH20_CSR_ACTIVE(x)        (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH20_CSR_ACTIVE_SHIFT)) & RESULT_DMA_TCD_CH20_CSR_ACTIVE_MASK)
/*! @} */

/*! @name CH20_ES - Channel Error Status */
/*! @{ */

