rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_RESULT_DMA_TCD.h
#define RESULT_DMA_TCD_TCD20_ATTR_SMOD_MASK      (0xF800U)
#define RESULT_DMA_TCD_TCD20_ATTR_SMOD_SHIFT     (11U)
#define RESULT_DMA_TCD_TCD20_ATTR_SMOD_WIDTH     (5U)
#define RESULT_DMA_TCD_TCD20_ATTR_SMOD(x)        (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD20_ATTR_SMOD_SHIFT)) & RESULT_DMA_TCD_TCD20_ATTR_SMOD_MASK)
/*! @} */

/*! @name TCD20_NBYTES_MLOFFNO - TCD Transfer Size Without Minor Loop Offsets */
/*! @{ */

#define RESULT_DMA_TCD_TCD20_NBYTES_MLOFFNO_NBYTES_MASK (0x3FFFFFFFU)
#define RESULT_DMA_TCD_TCD20_NBYTES_MLOFFNO_NBYTES_SHIFT (0U)
#define RESULT_DMA_TCD_TCD20_NBYTES_MLOFFNO_NBYTES_WIDTH (30U)
#define RESULT_DMA_TCD_TCD20_NBYTES_MLOFFNO_NBYTES(x) (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_TCD20_NBYTES_MLOFFNO_NBYTES_SHIFT)) & RESULT_DMA_TCD_TCD20_NBYTES_MLOFFNO_NBYTES_MASK)

#define RESULT_DMA_TCD_TCD20_NBYTES_MLOFFNO_DMLOE_MASK (0x40000000U)
#define RESULT_DMA_TCD_TCD20_NBYTES_MLOFFNO_DMLOE_SHIFT (30U)
#define RESULT_DMA_TCD_TCD20_NBYTES_MLOFFNO_DMLOE_WIDTH (1U)
#define RESULT_DMA_TCD_TCD20_NBYTES_MLOFFNO_DMLOE(x) (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_TCD20_NBYTES_MLOFFNO_DMLOE_SHIFT)) & RESULT_DMA_TCD_TCD20_NBYTES_MLOFFNO_DMLOE_MASK)

#define RESULT_DMA_TCD_TCD20_NBYTES_MLOFFNO_SMLOE_MASK (0x80000000U)
#define RESULT_DMA_TCD_TCD20_NBYTES_MLOFFNO_SMLOE_SHIFT (31U)
#define RESULT_DMA_TCD_TCD20_NBYTES_MLOFFNO_SMLOE_WIDTH (1U)
#define RESULT_DMA_TCD_TCD20_NBYTES_MLOFFNO_SMLOE(x) (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_TCD20_NBYTES_MLOFFNO_SMLOE_SHIFT)) & RESULT_DMA_TCD_TCD20_NBYTES_MLOFFNO_SMLOE_MASK)
/*! @} */

/*! @name TCD20_NBYTES_MLOFFYES - TCD Transfer Size with Minor Loop Offsets */
/*! @{ */

#define RESULT_DMA_TCD_TCD20_NBYTES_MLOFFYES_NBYTES_MASK (0x3FFU)
#define RESULT_DMA_TCD_TCD20_NBYTES_MLOFFYES_NBYTES_SHIFT (0U)
#define RESULT_DMA_TCD_TCD20_NBYTES_MLOFFYES_NBYTES_WIDTH (10U)
#define RESULT_DMA_TCD_TCD20_NBYTES_MLOFFYES_NBYTES(x) (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_TCD20_NBYTES_MLOFFYES_NBYTES_SHIFT)) & RESULT_DMA_TCD_TCD20_NBYTES_MLOFFYES_NBYTES_MASK)

#define RESULT_DMA_TCD_TCD20_NBYTES_MLOFFYES_MLOFF_MASK (0x3FFFFC00U)
#define RESULT_DMA_TCD_TCD20_NBYTES_MLOFFYES_MLOFF_SHIFT (10U)
#define RESULT_DMA_TCD_TCD20_NBYTES_MLOFFYES_MLOFF_WIDTH (20U)
#define RESULT_DMA_TCD_TCD20_NBYTES_MLOFFYES_MLOFF(x) (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_TCD20_NBYTES_MLOFFYES_MLOFF_SHIFT)) & RESULT_DMA_TCD_TCD20_NBYTES_MLOFFYES_MLOFF_MASK)

#define RESULT_DMA_TCD_TCD20_NBYTES_MLOFFYES_DMLOE_MASK (0x40000000U)
#define RESULT_DMA_TCD_TCD20_NBYTES_MLOFFYES_DMLOE_SHIFT (30U)
#define RESULT_DMA_TCD_TCD20_NBYTES_MLOFFYES_DMLOE_WIDTH (1U)
#define RESULT_DMA_TCD_TCD20_NBYTES_MLOFFYES_DMLOE(x) (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_TCD20_NBYTES_MLOFFYES_DMLOE_SHIFT)) & RESULT_DMA_TCD_TCD20_NBYTES_MLOFFYES_DMLOE_MASK)

#define RESULT_DMA_TCD_TCD20_NBYTES_MLOFFYES_SMLOE_MASK (0x80000000U)
#define RESULT_DMA_TCD_TCD20_NBYTES_MLOFFYES_SMLOE_SHIFT (31U)
#define RESULT_DMA_TCD_TCD20_NBYTES_MLOFFYES_SMLOE_WIDTH (1U)
#define RESULT_DMA_TCD_TCD20_NBYTES_MLOFFYES_SMLOE(x) (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_TCD20_NBYTES_MLOFFYES_SMLOE_SHIFT)) & RESULT_DMA_TCD_TCD20_NBYTES_MLOFFYES_SMLOE_MASK)
/*! @} */

/*! @name TCD20_SLAST_SDA - TCD Last Source Address Adjustment / Store DADDR Address */
/*! @{ */

#define RESULT_DMA_TCD_TCD20_SLAST_SDA_SLAST_SDA_MASK (0xFFFFFFFFU)
#define RESULT_DMA_TCD_TCD20_SLAST_SDA_SLAST_SDA_SHIFT (0U)
#define RESULT_DMA_TCD_TCD20_SLAST_SDA_SLAST_SDA_WIDTH (32U)
#define RESULT_DMA_TCD_TCD20_SLAST_SDA_SLAST_SDA(x) (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_TCD20_SLAST_SDA_SLAST_SDA_SHIFT)) & RESULT_DMA_TCD_TCD20_SLAST_SDA_SLAST_SDA_MASK)
/*! @} */

/*! @name TCD20_DADDR - TCD Destination Address */
/*! @{ */

#define RESULT_DMA_TCD_TCD20_DADDR_DADDR_MASK    (0xFFFFFFFFU)
#define RESULT_DMA_TCD_TCD20_DADDR_DADDR_SHIFT   (0U)
#define RESULT_DMA_TCD_TCD20_DADDR_DADDR_WIDTH   (32U)
#define RESULT_DMA_TCD_TCD20_DADDR_DADDR(x)      (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_TCD20_DADDR_DADDR_SHIFT)) & RESULT_DMA_TCD_TCD20_DADDR_DADDR_MASK)
/*! @} */

/*! @name TCD20_DOFF - TCD Signed Destination Address Offset */
/*! @{ */

#define RESULT_DMA_TCD_TCD20_DOFF_DOFF_MASK      (0xFFFFU)
#define RESULT_DMA_TCD_TCD20_DOFF_DOFF_SHIFT     (0U)
#define RESULT_DMA_TCD_TCD20_DOFF_DOFF_WIDTH     (16U)
#define RESULT_DMA_TCD_TCD20_DOFF_DOFF(x)        (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD20_DOFF_DOFF_SHIFT)) & RESULT_DMA_TCD_TCD20_DOFF_DOFF_MASK)
/*! @} */

/*! @name TCD20_CITER_ELINKNO - TCD Current Major Loop Count (Minor Loop Channel Linking Disabled) */
/*! @{ */

#define RESULT_DMA_TCD_TCD20_CITER_ELINKNO_CITER_MASK (0x7FFFU)
#define RESULT_DMA_TCD_TCD20_CITER_ELINKNO_CITER_SHIFT (0U)
#define RESULT_DMA_TCD_TCD20_CITER_ELINKNO_CITER_WIDTH (15U)
#define RESULT_DMA_TCD_TCD20_CITER_ELINKNO_CITER(x) (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD20_CITER_ELINKNO_CITER_SHIFT)) & RESULT_DMA_TCD_TCD20_CITER_ELINKNO_CITER_MASK)

#define RESULT_DMA_TCD_TCD20_CITER_ELINKNO_ELINK_MASK (0x8000U)
#define RESULT_DMA_TCD_TCD20_CITER_ELINKNO_ELINK_SHIFT (15U)
#define RESULT_DMA_TCD_TCD20_CITER_ELINKNO_ELINK_WIDTH (1U)
#define RESULT_DMA_TCD_TCD20_CITER_ELINKNO_ELINK(x) (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD20_CITER_ELINKNO_ELINK_SHIFT)) & RESULT_DMA_TCD_TCD20_CITER_ELINKNO_ELINK_MASK)
/*! @} */

/*! @name TCD20_CITER_ELINKYES - TCD Current Major Loop Count (Minor Loop Channel Linking Enabled) */
/*! @{ */

#define RESULT_DMA_TCD_TCD20_CITER_ELINKYES_CITER_MASK (0x1FFU)
#define RESULT_DMA_TCD_TCD20_CITER_ELINKYES_CITER_SHIFT (0U)
#define RESULT_DMA_TCD_TCD20_CITER_ELINKYES_CITER_WIDTH (9U)
#define RESULT_DMA_TCD_TCD20_CITER_ELINKYES_CITER(x) (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD20_CITER_ELINKYES_CITER_SHIFT)) & RESULT_DMA_TCD_TCD20_CITER_ELINKYES_CITER_MASK)

#define RESULT_DMA_TCD_TCD20_CITER_ELINKYES_LINKCH_MASK (0x3E00U)
#define RESULT_DMA_TCD_TCD20_CITER_ELINKYES_LINKCH_SHIFT (9U)
#define RESULT_DMA_TCD_TCD20_CITER_ELINKYES_LINKCH_WIDTH (5U)
#define RESULT_DMA_TCD_TCD20_CITER_ELINKYES_LINKCH(x) (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD20_CITER_ELINKYES_LINKCH_SHIFT)) & RESULT_DMA_TCD_TCD20_CITER_ELINKYES_LINKCH_MASK)

#define RESULT_DMA_TCD_TCD20_CITER_ELINKYES_ELINK_MASK (0x8000U)
#define RESULT_DMA_TCD_TCD20_CITER_ELINKYES_ELINK_SHIFT (15U)
#define RESULT_DMA_TCD_TCD20_CITER_ELINKYES_ELINK_WIDTH (1U)
#define RESULT_DMA_TCD_TCD20_CITER_ELINKYES_ELINK(x) (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD20_CITER_ELINKYES_ELINK_SHIFT)) & RESULT_DMA_TCD_TCD20_CITER_ELINKYES_ELINK_MASK)
/*! @} */

/*! @name TCD20_DLAST_SGA - TCD Last Destination Address Adjustment / Scatter Gather Address */
/*! @{ */

#define RESULT_DMA_TCD_TCD20_DLAST_SGA_DLAST_SGA_MASK (0xFFFFFFFFU)
#define RESULT_DMA_TCD_TCD20_DLAST_SGA_DLAST_SGA_SHIFT (0U)
#define RESULT_DMA_TCD_TCD20_DLAST_SGA_DLAST_SGA_WIDTH (32U)
#define RESULT_DMA_TCD_TCD20_DLAST_SGA_DLAST_SGA(x) (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_TCD20_DLAST_SGA_DLAST_SGA_SHIFT)) & RESULT_DMA_TCD_TCD20_DLAST_SGA_DLAST_SGA_MASK)
/*! @} */

/*! @name TCD20_CSR - TCD Control and Status */
/*! @{ */

#define RESULT_DMA_TCD_TCD20_CSR_START_MASK      (0x1U)
#define RESULT_DMA_TCD_TCD20_CSR_START_SHIFT     (0U)
#define RESULT_DMA_TCD_TCD20_CSR_START_WIDTH     (1U)
#define RESULT_DMA_TCD_TCD20_CSR_START(x)        (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD20_CSR_START_SHIFT)) & RESULT_DMA_TCD_TCD20_CSR_START_MASK)

#define RESULT_DMA_TCD_TCD20_CSR_INTMAJOR_MASK   (0x2U)
#define RESULT_DMA_TCD_TCD20_CSR_INTMAJOR_SHIFT  (1U)
#define RESULT_DMA_TCD_TCD20_CSR_INTMAJOR_WIDTH  (1U)
#define RESULT_DMA_TCD_TCD20_CSR_INTMAJOR(x)     (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD20_CSR_INTMAJOR_SHIFT)) & RESULT_DMA_TCD_TCD20_CSR_INTMAJOR_MASK)

