rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_RESULT_DMA_TCD.h
#define RESULT_DMA_TCD_CH14_SBR_ATTR_MASK        (0xE0000U)
#define RESULT_DMA_TCD_CH14_SBR_ATTR_SHIFT       (17U)
#define RESULT_DMA_TCD_CH14_SBR_ATTR_WIDTH       (3U)
#define RESULT_DMA_TCD_CH14_SBR_ATTR(x)          (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH14_SBR_ATTR_SHIFT)) & RESULT_DMA_TCD_CH14_SBR_ATTR_MASK)
/*! @} */

/*! @name CH14_PRI - Channel Priority */
/*! @{ */

#define RESULT_DMA_TCD_CH14_PRI_APL_MASK         (0x7U)
#define RESULT_DMA_TCD_CH14_PRI_APL_SHIFT        (0U)
#define RESULT_DMA_TCD_CH14_PRI_APL_WIDTH        (3U)
#define RESULT_DMA_TCD_CH14_PRI_APL(x)           (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH14_PRI_APL_SHIFT)) & RESULT_DMA_TCD_CH14_PRI_APL_MASK)

#define RESULT_DMA_TCD_CH14_PRI_DPA_MASK         (0x40000000U)
#define RESULT_DMA_TCD_CH14_PRI_DPA_SHIFT        (30U)
#define RESULT_DMA_TCD_CH14_PRI_DPA_WIDTH        (1U)
#define RESULT_DMA_TCD_CH14_PRI_DPA(x)           (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH14_PRI_DPA_SHIFT)) & RESULT_DMA_TCD_CH14_PRI_DPA_MASK)

#define RESULT_DMA_TCD_CH14_PRI_ECP_MASK         (0x80000000U)
#define RESULT_DMA_TCD_CH14_PRI_ECP_SHIFT        (31U)
#define RESULT_DMA_TCD_CH14_PRI_ECP_WIDTH        (1U)
#define RESULT_DMA_TCD_CH14_PRI_ECP(x)           (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH14_PRI_ECP_SHIFT)) & RESULT_DMA_TCD_CH14_PRI_ECP_MASK)
/*! @} */

/*! @name TCD14_SADDR - TCD Source Address */
/*! @{ */

#define RESULT_DMA_TCD_TCD14_SADDR_SADDR_MASK    (0xFFFFFFFFU)
#define RESULT_DMA_TCD_TCD14_SADDR_SADDR_SHIFT   (0U)
#define RESULT_DMA_TCD_TCD14_SADDR_SADDR_WIDTH   (32U)
#define RESULT_DMA_TCD_TCD14_SADDR_SADDR(x)      (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_TCD14_SADDR_SADDR_SHIFT)) & RESULT_DMA_TCD_TCD14_SADDR_SADDR_MASK)
/*! @} */

/*! @name TCD14_SOFF - TCD Signed Source Address Offset */
/*! @{ */

#define RESULT_DMA_TCD_TCD14_SOFF_SOFF_MASK      (0xFFFFU)
#define RESULT_DMA_TCD_TCD14_SOFF_SOFF_SHIFT     (0U)
#define RESULT_DMA_TCD_TCD14_SOFF_SOFF_WIDTH     (16U)
#define RESULT_DMA_TCD_TCD14_SOFF_SOFF(x)        (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD14_SOFF_SOFF_SHIFT)) & RESULT_DMA_TCD_TCD14_SOFF_SOFF_MASK)
/*! @} */

/*! @name TCD14_ATTR - TCD Transfer Attributes */
/*! @{ */

#define RESULT_DMA_TCD_TCD14_ATTR_DSIZE_MASK     (0x7U)
#define RESULT_DMA_TCD_TCD14_ATTR_DSIZE_SHIFT    (0U)
#define RESULT_DMA_TCD_TCD14_ATTR_DSIZE_WIDTH    (3U)
#define RESULT_DMA_TCD_TCD14_ATTR_DSIZE(x)       (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD14_ATTR_DSIZE_SHIFT)) & RESULT_DMA_TCD_TCD14_ATTR_DSIZE_MASK)

#define RESULT_DMA_TCD_TCD14_ATTR_DMOD_MASK      (0xF8U)
#define RESULT_DMA_TCD_TCD14_ATTR_DMOD_SHIFT     (3U)
#define RESULT_DMA_TCD_TCD14_ATTR_DMOD_WIDTH     (5U)
#define RESULT_DMA_TCD_TCD14_ATTR_DMOD(x)        (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD14_ATTR_DMOD_SHIFT)) & RESULT_DMA_TCD_TCD14_ATTR_DMOD_MASK)

#define RESULT_DMA_TCD_TCD14_ATTR_SSIZE_MASK     (0x700U)
#define RESULT_DMA_TCD_TCD14_ATTR_SSIZE_SHIFT    (8U)
#define RESULT_DMA_TCD_TCD14_ATTR_SSIZE_WIDTH    (3U)
#define RESULT_DMA_TCD_TCD14_ATTR_SSIZE(x)       (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD14_ATTR_SSIZE_SHIFT)) & RESULT_DMA_TCD_TCD14_ATTR_SSIZE_MASK)

#define RESULT_DMA_TCD_TCD14_ATTR_SMOD_MASK      (0xF800U)
#define RESULT_DMA_TCD_TCD14_ATTR_SMOD_SHIFT     (11U)
#define RESULT_DMA_TCD_TCD14_ATTR_SMOD_WIDTH     (5U)
#define RESULT_DMA_TCD_TCD14_ATTR_SMOD(x)        (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD14_ATTR_SMOD_SHIFT)) & RESULT_DMA_TCD_TCD14_ATTR_SMOD_MASK)
/*! @} */

/*! @name TCD14_NBYTES_MLOFFNO - TCD Transfer Size Without Minor Loop Offsets */
/*! @{ */

#define RESULT_DMA_TCD_TCD14_NBYTES_MLOFFNO_NBYTES_MASK (0x3FFFFFFFU)
#define RESULT_DMA_TCD_TCD14_NBYTES_MLOFFNO_NBYTES_SHIFT (0U)
#define RESULT_DMA_TCD_TCD14_NBYTES_MLOFFNO_NBYTES_WIDTH (30U)
#define RESULT_DMA_TCD_TCD14_NBYTES_MLOFFNO_NBYTES(x) (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_TCD14_NBYTES_MLOFFNO_NBYTES_SHIFT)) & RESULT_DMA_TCD_TCD14_NBYTES_MLOFFNO_NBYTES_MASK)

#define RESULT_DMA_TCD_TCD14_NBYTES_MLOFFNO_DMLOE_MASK (0x40000000U)
#define RESULT_DMA_TCD_TCD14_NBYTES_MLOFFNO_DMLOE_SHIFT (30U)
#define RESULT_DMA_TCD_TCD14_NBYTES_MLOFFNO_DMLOE_WIDTH (1U)
#define RESULT_DMA_TCD_TCD14_NBYTES_MLOFFNO_DMLOE(x) (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_TCD14_NBYTES_MLOFFNO_DMLOE_SHIFT)) & RESULT_DMA_TCD_TCD14_NBYTES_MLOFFNO_DMLOE_MASK)

#define RESULT_DMA_TCD_TCD14_NBYTES_MLOFFNO_SMLOE_MASK (0x80000000U)
#define RESULT_DMA_TCD_TCD14_NBYTES_MLOFFNO_SMLOE_SHIFT (31U)
#define RESULT_DMA_TCD_TCD14_NBYTES_MLOFFNO_SMLOE_WIDTH (1U)
#define RESULT_DMA_TCD_TCD14_NBYTES_MLOFFNO_SMLOE(x) (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_TCD14_NBYTES_MLOFFNO_SMLOE_SHIFT)) & RESULT_DMA_TCD_TCD14_NBYTES_MLOFFNO_SMLOE_MASK)
/*! @} */

/*! @name TCD14_NBYTES_MLOFFYES - TCD Transfer Size with Minor Loop Offsets */
/*! @{ */

#define RESULT_DMA_TCD_TCD14_NBYTES_MLOFFYES_NBYTES_MASK (0x3FFU)
#define RESULT_DMA_TCD_TCD14_NBYTES_MLOFFYES_NBYTES_SHIFT (0U)
#define RESULT_DMA_TCD_TCD14_NBYTES_MLOFFYES_NBYTES_WIDTH (10U)
#define RESULT_DMA_TCD_TCD14_NBYTES_MLOFFYES_NBYTES(x) (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_TCD14_NBYTES_MLOFFYES_NBYTES_SHIFT)) & RESULT_DMA_TCD_TCD14_NBYTES_MLOFFYES_NBYTES_MASK)

#define RESULT_DMA_TCD_TCD14_NBYTES_MLOFFYES_MLOFF_MASK (0x3FFFFC00U)
#define RESULT_DMA_TCD_TCD14_NBYTES_MLOFFYES_MLOFF_SHIFT (10U)
#define RESULT_DMA_TCD_TCD14_NBYTES_MLOFFYES_MLOFF_WIDTH (20U)
#define RESULT_DMA_TCD_TCD14_NBYTES_MLOFFYES_MLOFF(x) (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_TCD14_NBYTES_MLOFFYES_MLOFF_SHIFT)) & RESULT_DMA_TCD_TCD14_NBYTES_MLOFFYES_MLOFF_MASK)

#define RESULT_DMA_TCD_TCD14_NBYTES_MLOFFYES_DMLOE_MASK (0x40000000U)
#define RESULT_DMA_TCD_TCD14_NBYTES_MLOFFYES_DMLOE_SHIFT (30U)
#define RESULT_DMA_TCD_TCD14_NBYTES_MLOFFYES_DMLOE_WIDTH (1U)
#define RESULT_DMA_TCD_TCD14_NBYTES_MLOFFYES_DMLOE(x) (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_TCD14_NBYTES_MLOFFYES_DMLOE_SHIFT)) & RESULT_DMA_TCD_TCD14_NBYTES_MLOFFYES_DMLOE_MASK)

