rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_RESULT_DMA_TCD.h
#define RESULT_DMA_TCD_CH22_ES_DOE_MASK          (0x10U)
#define RESULT_DMA_TCD_CH22_ES_DOE_SHIFT         (4U)
#define RESULT_DMA_TCD_CH22_ES_DOE_WIDTH         (1U)
#define RESULT_DMA_TCD_CH22_ES_DOE(x)            (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH22_ES_DOE_SHIFT)) & RESULT_DMA_TCD_CH22_ES_DOE_MASK)

#define RESULT_DMA_TCD_CH22_ES_DAE_MASK          (0x20U)
#define RESULT_DMA_TCD_CH22_ES_DAE_SHIFT         (5U)
#define RESULT_DMA_TCD_CH22_ES_DAE_WIDTH         (1U)
#define RESULT_DMA_TCD_CH22_ES_DAE(x)            (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH22_ES_DAE_SHIFT)) & RESULT_DMA_TCD_CH22_ES_DAE_MASK)

#define RESULT_DMA_TCD_CH22_ES_SOE_MASK          (0x40U)
#define RESULT_DMA_TCD_CH22_ES_SOE_SHIFT         (6U)
#define RESULT_DMA_TCD_CH22_ES_SOE_WIDTH         (1U)
#define RESULT_DMA_TCD_CH22_ES_SOE(x)            (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH22_ES_SOE_SHIFT)) & RESULT_DMA_TCD_CH22_ES_SOE_MASK)

#define RESULT_DMA_TCD_CH22_ES_SAE_MASK          (0x80U)
#define RESULT_DMA_TCD_CH22_ES_SAE_SHIFT         (7U)
#define RESULT_DMA_TCD_CH22_ES_SAE_WIDTH         (1U)
#define RESULT_DMA_TCD_CH22_ES_SAE(x)            (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH22_ES_SAE_SHIFT)) & RESULT_DMA_TCD_CH22_ES_SAE_MASK)

#define RESULT_DMA_TCD_CH22_ES_ERR_MASK          (0x80000000U)
#define RESULT_DMA_TCD_CH22_ES_ERR_SHIFT         (31U)
#define RESULT_DMA_TCD_CH22_ES_ERR_WIDTH         (1U)
#define RESULT_DMA_TCD_CH22_ES_ERR(x)            (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH22_ES_ERR_SHIFT)) & RESULT_DMA_TCD_CH22_ES_ERR_MASK)
/*! @} */

/*! @name CH22_INT - Channel Interrupt Status */
/*! @{ */

#define RESULT_DMA_TCD_CH22_INT_INT_MASK         (0x1U)
#define RESULT_DMA_TCD_CH22_INT_INT_SHIFT        (0U)
#define RESULT_DMA_TCD_CH22_INT_INT_WIDTH        (1U)
#define RESULT_DMA_TCD_CH22_INT_INT(x)           (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH22_INT_INT_SHIFT)) & RESULT_DMA_TCD_CH22_INT_INT_MASK)
/*! @} */

/*! @name CH22_SBR - Channel System Bus */
/*! @{ */

#define RESULT_DMA_TCD_CH22_SBR_MID_MASK         (0x3FU)
#define RESULT_DMA_TCD_CH22_SBR_MID_SHIFT        (0U)
#define RESULT_DMA_TCD_CH22_SBR_MID_WIDTH        (6U)
#define RESULT_DMA_TCD_CH22_SBR_MID(x)           (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH22_SBR_MID_SHIFT)) & RESULT_DMA_TCD_CH22_SBR_MID_MASK)

#define RESULT_DMA_TCD_CH22_SBR_PAL_MASK         (0x8000U)
#define RESULT_DMA_TCD_CH22_SBR_PAL_SHIFT        (15U)
#define RESULT_DMA_TCD_CH22_SBR_PAL_WIDTH        (1U)
#define RESULT_DMA_TCD_CH22_SBR_PAL(x)           (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH22_SBR_PAL_SHIFT)) & RESULT_DMA_TCD_CH22_SBR_PAL_MASK)

#define RESULT_DMA_TCD_CH22_SBR_EMI_MASK         (0x10000U)
#define RESULT_DMA_TCD_CH22_SBR_EMI_SHIFT        (16U)
#define RESULT_DMA_TCD_CH22_SBR_EMI_WIDTH        (1U)
#define RESULT_DMA_TCD_CH22_SBR_EMI(x)           (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH22_SBR_EMI_SHIFT)) & RESULT_DMA_TCD_CH22_SBR_EMI_MASK)

#define RESULT_DMA_TCD_CH22_SBR_ATTR_MASK        (0xE0000U)
#define RESULT_DMA_TCD_CH22_SBR_ATTR_SHIFT       (17U)
#define RESULT_DMA_TCD_CH22_SBR_ATTR_WIDTH       (3U)
#define RESULT_DMA_TCD_CH22_SBR_ATTR(x)          (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH22_SBR_ATTR_SHIFT)) & RESULT_DMA_TCD_CH22_SBR_ATTR_MASK)
/*! @} */

/*! @name CH22_PRI - Channel Priority */
/*! @{ */

#define RESULT_DMA_TCD_CH22_PRI_APL_MASK         (0x7U)
#define RESULT_DMA_TCD_CH22_PRI_APL_SHIFT        (0U)
#define RESULT_DMA_TCD_CH22_PRI_APL_WIDTH        (3U)
#define RESULT_DMA_TCD_CH22_PRI_APL(x)           (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH22_PRI_APL_SHIFT)) & RESULT_DMA_TCD_CH22_PRI_APL_MASK)

#define RESULT_DMA_TCD_CH22_PRI_DPA_MASK         (0x40000000U)
#define RESULT_DMA_TCD_CH22_PRI_DPA_SHIFT        (30U)
#define RESULT_DMA_TCD_CH22_PRI_DPA_WIDTH        (1U)
#define RESULT_DMA_TCD_CH22_PRI_DPA(x)           (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH22_PRI_DPA_SHIFT)) & RESULT_DMA_TCD_CH22_PRI_DPA_MASK)

#define RESULT_DMA_TCD_CH22_PRI_ECP_MASK         (0x80000000U)
#define RESULT_DMA_TCD_CH22_PRI_ECP_SHIFT        (31U)
#define RESULT_DMA_TCD_CH22_PRI_ECP_WIDTH        (1U)
#define RESULT_DMA_TCD_CH22_PRI_ECP(x)           (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_CH22_PRI_ECP_SHIFT)) & RESULT_DMA_TCD_CH22_PRI_ECP_MASK)
/*! @} */

/*! @name TCD22_SADDR - TCD Source Address */
/*! @{ */

#define RESULT_DMA_TCD_TCD22_SADDR_SADDR_MASK    (0xFFFFFFFFU)
#define RESULT_DMA_TCD_TCD22_SADDR_SADDR_SHIFT   (0U)
#define RESULT_DMA_TCD_TCD22_SADDR_SADDR_WIDTH   (32U)
#define RESULT_DMA_TCD_TCD22_SADDR_SADDR(x)      (((uint32_t)(((uint32_t)(x)) << RESULT_DMA_TCD_TCD22_SADDR_SADDR_SHIFT)) & RESULT_DMA_TCD_TCD22_SADDR_SADDR_MASK)
/*! @} */

/*! @name TCD22_SOFF - TCD Signed Source Address Offset */
/*! @{ */

#define RESULT_DMA_TCD_TCD22_SOFF_SOFF_MASK      (0xFFFFU)
#define RESULT_DMA_TCD_TCD22_SOFF_SOFF_SHIFT     (0U)
#define RESULT_DMA_TCD_TCD22_SOFF_SOFF_WIDTH     (16U)
#define RESULT_DMA_TCD_TCD22_SOFF_SOFF(x)        (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD22_SOFF_SOFF_SHIFT)) & RESULT_DMA_TCD_TCD22_SOFF_SOFF_MASK)
/*! @} */

/*! @name TCD22_ATTR - TCD Transfer Attributes */
/*! @{ */

#define RESULT_DMA_TCD_TCD22_ATTR_DSIZE_MASK     (0x7U)
#define RESULT_DMA_TCD_TCD22_ATTR_DSIZE_SHIFT    (0U)
#define RESULT_DMA_TCD_TCD22_ATTR_DSIZE_WIDTH    (3U)
#define RESULT_DMA_TCD_TCD22_ATTR_DSIZE(x)       (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD22_ATTR_DSIZE_SHIFT)) & RESULT_DMA_TCD_TCD22_ATTR_DSIZE_MASK)

#define RESULT_DMA_TCD_TCD22_ATTR_DMOD_MASK      (0xF8U)
#define RESULT_DMA_TCD_TCD22_ATTR_DMOD_SHIFT     (3U)
#define RESULT_DMA_TCD_TCD22_ATTR_DMOD_WIDTH     (5U)
#define RESULT_DMA_TCD_TCD22_ATTR_DMOD(x)        (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD22_ATTR_DMOD_SHIFT)) & RESULT_DMA_TCD_TCD22_ATTR_DMOD_MASK)

#define RESULT_DMA_TCD_TCD22_ATTR_SSIZE_MASK     (0x700U)
#define RESULT_DMA_TCD_TCD22_ATTR_SSIZE_SHIFT    (8U)
#define RESULT_DMA_TCD_TCD22_ATTR_SSIZE_WIDTH    (3U)
#define RESULT_DMA_TCD_TCD22_ATTR_SSIZE(x)       (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD22_ATTR_SSIZE_SHIFT)) & RESULT_DMA_TCD_TCD22_ATTR_SSIZE_MASK)

#define RESULT_DMA_TCD_TCD22_ATTR_SMOD_MASK      (0xF800U)
#define RESULT_DMA_TCD_TCD22_ATTR_SMOD_SHIFT     (11U)
#define RESULT_DMA_TCD_TCD22_ATTR_SMOD_WIDTH     (5U)
#define RESULT_DMA_TCD_TCD22_ATTR_SMOD(x)        (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD22_ATTR_SMOD_SHIFT)) & RESULT_DMA_TCD_TCD22_ATTR_SMOD_MASK)
/*! @} */

