rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_RESULT_DMA_TCD.h
#define RESULT_DMA_TCD_TCD23_CSR_MAJORLINKCH_MASK (0x1F00U)
#define RESULT_DMA_TCD_TCD23_CSR_MAJORLINKCH_SHIFT (8U)
#define RESULT_DMA_TCD_TCD23_CSR_MAJORLINKCH_WIDTH (5U)
#define RESULT_DMA_TCD_TCD23_CSR_MAJORLINKCH(x)  (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD23_CSR_MAJORLINKCH_SHIFT)) & RESULT_DMA_TCD_TCD23_CSR_MAJORLINKCH_MASK)

#define RESULT_DMA_TCD_TCD23_CSR_BWC_MASK        (0xC000U)
#define RESULT_DMA_TCD_TCD23_CSR_BWC_SHIFT       (14U)
#define RESULT_DMA_TCD_TCD23_CSR_BWC_WIDTH       (2U)
#define RESULT_DMA_TCD_TCD23_CSR_BWC(x)          (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD23_CSR_BWC_SHIFT)) & RESULT_DMA_TCD_TCD23_CSR_BWC_MASK)
/*! @} */

/*! @name TCD23_BITER_ELINKNO - TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled) */
/*! @{ */

#define RESULT_DMA_TCD_TCD23_BITER_ELINKNO_BITER_MASK (0x7FFFU)
#define RESULT_DMA_TCD_TCD23_BITER_ELINKNO_BITER_SHIFT (0U)
#define RESULT_DMA_TCD_TCD23_BITER_ELINKNO_BITER_WIDTH (15U)
#define RESULT_DMA_TCD_TCD23_BITER_ELINKNO_BITER(x) (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD23_BITER_ELINKNO_BITER_SHIFT)) & RESULT_DMA_TCD_TCD23_BITER_ELINKNO_BITER_MASK)

#define RESULT_DMA_TCD_TCD23_BITER_ELINKNO_ELINK_MASK (0x8000U)
#define RESULT_DMA_TCD_TCD23_BITER_ELINKNO_ELINK_SHIFT (15U)
#define RESULT_DMA_TCD_TCD23_BITER_ELINKNO_ELINK_WIDTH (1U)
#define RESULT_DMA_TCD_TCD23_BITER_ELINKNO_ELINK(x) (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD23_BITER_ELINKNO_ELINK_SHIFT)) & RESULT_DMA_TCD_TCD23_BITER_ELINKNO_ELINK_MASK)
/*! @} */

/*! @name TCD23_BITER_ELINKYES - TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled) */
/*! @{ */

#define RESULT_DMA_TCD_TCD23_BITER_ELINKYES_BITER_MASK (0x1FFU)
#define RESULT_DMA_TCD_TCD23_BITER_ELINKYES_BITER_SHIFT (0U)
#define RESULT_DMA_TCD_TCD23_BITER_ELINKYES_BITER_WIDTH (9U)
#define RESULT_DMA_TCD_TCD23_BITER_ELINKYES_BITER(x) (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD23_BITER_ELINKYES_BITER_SHIFT)) & RESULT_DMA_TCD_TCD23_BITER_ELINKYES_BITER_MASK)

#define RESULT_DMA_TCD_TCD23_BITER_ELINKYES_LINKCH_MASK (0x3E00U)
#define RESULT_DMA_TCD_TCD23_BITER_ELINKYES_LINKCH_SHIFT (9U)
#define RESULT_DMA_TCD_TCD23_BITER_ELINKYES_LINKCH_WIDTH (5U)
#define RESULT_DMA_TCD_TCD23_BITER_ELINKYES_LINKCH(x) (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD23_BITER_ELINKYES_LINKCH_SHIFT)) & RESULT_DMA_TCD_TCD23_BITER_ELINKYES_LINKCH_MASK)

#define RESULT_DMA_TCD_TCD23_BITER_ELINKYES_ELINK_MASK (0x8000U)
#define RESULT_DMA_TCD_TCD23_BITER_ELINKYES_ELINK_SHIFT (15U)
#define RESULT_DMA_TCD_TCD23_BITER_ELINKYES_ELINK_WIDTH (1U)
#define RESULT_DMA_TCD_TCD23_BITER_ELINKYES_ELINK(x) (((uint16_t)(((uint16_t)(x)) << RESULT_DMA_TCD_TCD23_BITER_ELINKYES_ELINK_SHIFT)) & RESULT_DMA_TCD_TCD23_BITER_ELINKYES_ELINK_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group RESULT_DMA_TCD_Register_Masks */

/*!
 * @}
 */ /* end of group RESULT_DMA_TCD_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K388_RESULT_DMA_TCD_H_) */
